# ----------------------------------------------------------------------------------------------------------------------
# --- Тексты для приветственной цепочки (онбординга) ---
# ----------------------------------------------------------------------------------------------------------------------
# Шаг 1: Приветствие
MSG_STEP_1 = """Привет, {name}!
<b>Я — Ева. Твой личный онлайн-психолог🪽</b>

Ты можешь <b>поговорить со мной в любое время о чем угодно</b>, я помогу тебе разобраться: в мыслях, чувствах и запутанных ситуациях. Без оценок и ярлыков

<b>Я рядом, когда тревожно, пусто, непонятно или наоборот — когда хочется большего🫂</b>

🙏🏻И если ты не против, давай начнём наше знакомство с твоего <b>честного и подробного прогноза будущего на ближайшие 5 лет</b> — я соберу его по твоим ответам и помогу увидеть, куда ведёт твой путь прямо сейчас✨
"""

# Шаг 2: Темы для обсуждения
MSG_STEP_2 = """<b>С тобой, мы можем говорить о том, от чего хочется уйти, и к чему хочется прийти❤️</b>

<b>ОТ:</b>
— тревоги, усталости и вечной спешки 💭
— чувства вины и самокритики 😔
— сложных отношений❤️‍🔥
— путаницы в целях, потерянности и выгорания  🙃
— страха быть «не такой и недостаточной» 🫣
<b>К</b>:
— спокойствию и внутренней опоре 🌿
— принятию себя и уверенности 😌
— зрелой любви и честным отношениям 💫
— ясности, энергии и смыслу в делах ⚡️
— росту, вдохновению и ощущению жизни ✨

<b>А ещё — просто о том, что тебя волнует. От «что мне  делать с этим тюбиком» до «у меня холодная мать»</b>
"""

# Шаг 3: Методики
MSG_STEP_3 = """<b>В наших разговорах я буду мягко вплетать в диалог разные методы, проверенные психотерапией и временем👩‍🏫</b>

Я отлично владею <b>КПТ</b> (когнитивно-поведенческой терапией) — чтобы разобраться с мыслями. Так же я буду пользоваться <b>психоанализом, коучингом</b> и большим количеством разных практик <b>(телесных, дыхательных и т.д)</b> 💆🏼‍♀️

Мы будем вместе смотреть, что откликается и <b>действительно помогает тебе чувствовать себя легче и увереннее✨</b>
"""

# Шаг 4: База знаний
MSG_STEP_4 = """<b>Я работаю на базе самой эффективной версии нейросети OpenAI🔥</b>

Я не просто “умная программа” — я обучена на <b>тысячах проверенных книг, научных исследований и терапевтических кейсов в области психологии и психиатрии</b>

Я разрабатывалась под контролем <b>целой команды психологов и обладаю огромной базой психологических знаний</b>

🌍Мировые (ссылка) исследования показывают, что такие системы уже помогают точнее видеть причины переживаний и подбирать рабочие методы

Я уникальный в своем роде <b>проект, который уже делает жизни тысячи женщин лучше🥹</b>
"""

# Шаг 5: Ограничения
MSG_STEP_5 = """<b>Я буду общаться с тобой как настоящий психолог — внимательно, с эмпатией и уважением к твоим чувствам🫂</b>
Но важно помнить: я всё же нейросеть, которая даёт базовую психологическую поддержку

❌Если тебе действительно тяжело — лучше обратиться к живому специалисту.
"""

# Шаг 6: Конфиденциальность
MSG_STEP_6 = """<b>🔒 Всё, что ты пишешь, остаётся между нами !

Я не передаю твои данные третьим лицам — это важно и для меня, и для нашего проекта✅</b>

Моя команда написала <b>прозрачную и понятную</b> <a href="https://disk.yandex.ru/i/EIYdHqGBDWw-qQ">Политику конфиденциальности</a>, с которыми ты <a href="https://disk.yandex.ru/i/cEr772F0eGddGg">соглашаешься</a>, продолжая разговор

<b>🧠Я храню только некоторые сообщения чтобы помнить контекст</b> и работать с тобой персонально и глубоко

<b>🫂Ведь безопасность, очень важна, согласна?</b>
"""

# Шаг 7: Обратная связь
MSG_STEP_7 = """Модуль обратной связи."""

# Шаг 8: Переход к прогнозу (перед вызовом n8n)
MSG_START_FORECAST = """Отлично! Я рада, что ты готова начать.

Сейчас начнется наш опрос для составления твоего личного прогноза. Это займет около 3-4 минут.
"""
# ----------------------------------------------------------------------------------------------------------------------
